Nicolai-Electronics/tanmatsu-radio/sdkconfig.defaults
# This file was generated using idf.py save-defconfig. It can be edited manually.
# Espressif IoT Development Framework (ESP-IDF) 5.5.3 Project Minimal Configuration
#
CONFIG_IDF_TARGET="esp32c6"
CONFIG_BOOTLOADER_LOG_LEVEL_WARN=y
CONFIG_BOOTLOADER_CUSTOM_RESERVE_RTC=y
CONFIG_BOOTLOADER_CUSTOM_RESERVE_RTC_SIZE=0x100
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partition_tables/tanmatsu_radio.csv"
CONFIG_ESP_HOSTED_COPROCESSOR_APP_MAIN=n
CONFIG_ESP_SDIO_PIN_CMD=18
CONFIG_ESP_SDIO_PIN_CLK=19
CONFIG_ESP_SDIO_PIN_D0=20
CONFIG_ESP_SDIO_PIN_D1=21
CONFIG_ESP_SDIO_PIN_D2=22
CONFIG_ESP_SDIO_PIN_D3=23
CONFIG_ESP_HOSTED_DEFAULT_TASK_PRIORITY=22
CONFIG_ESP_CACHE_MALLOC=n
CONFIG_ESP_PKT_STATS=y
CONFIG_ESP_HOSTED_HOST_POWER_SAVE_ENABLED=y
CONFIG_ESP_HOSTED_HOST_WAKEUP_GPIO=8
CONFIG_ESP_HOSTED_HOST_WAKEUP_GPIO_LEVEL_LOW=y
CONFIG_PRINT_HOST_WAKEUP_PACKET_FULL_PKT=y
CONFIG_BT_ENABLED=y
CONFIG_BT_CONTROLLER_ONLY=y
CONFIG_HTTPD_MAX_REQ_HDR_LEN=512
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
CONFIG_ESP_WIFI_NVS_ENABLED=n
CONFIG_FREERTOS_HZ=1000
CONFIG_SPI_FLASH_DANGEROUS_WRITE_ALLOWED=y
